Tekla Open API Reference for Tekla Structures 2025
IEvents Events
The IEvents type exposes the following members.
Events
Name | Description
ClashCheckDone
 The ClashCheckDone event is raised just after clash check is completed.
ClashDetected
 The ClashDetected event is raised just after the detection of each clash. The clash information is saved before the event is triggered.
ClipPlaneChanged
 Occurs when clip plane is changed.
CommandStatusChange
 The CommandStatusChange event is raised when a command is started/ended.
Interrupted
 Occurs when user interrupts.
ModelChanged
 The ModelChanged event is raised just after some changes have been made to the model.
Note, this event is however not triggered when UNDO or REDO are performed.
ModelLoad
 The ModelLoad event is raised just after a model has been loaded.
ModelLoadInfo
 The ModelLoadInfo event is raised just after a model has been loaded with the model load information as a string parameter.
ModelObjectChanged
 The ModelObjectChanged event is raised just after some changes have been made to the model objects.
Note, this event is triggered when UNDO or REDO are performed!!
ModelObjectNumbered
 The ModelObjectNumbered event is raised when model object is numbered.
ModelSave
 The ModelSave event is raised just after a model has been saved.
ModelSaveAs
 The ModelSaveAs event is raised just after a model has been saved using save as.
ModelSaveInfo
 The ModelSave event is raised just after a model has been saved with the model save information as a string parameter.
ModelUnloading
 The ModelUnloading event is raised just before the model is unloaded.
Numbering
 The Numbering event is raised just after a model has been numbered.
ProjectInfoChanged
 The ProjectInfoChanged event is raised just after some changes have been made to the project info.
Note, this event is however not triggered when UNDO or REDO are performed.
SelectionChange
 The SelectionChange event is raised when the user changes the current selection inside Tekla Structures.
TeklaStructuresExit
 The TeklaStructuresExit event is raised just before Tekla Structures exits. After this event has been called the user will no longer be able to perform any calls to Tekla Structures.
ViewCameraChanged
 Occurs when view camera is changed.
Top
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace